void Main()
    {
        // Задаем день недели прямо в коде
        String day = "суббота";

        switch (day.ToLower())
        {
            case "понедельник":
            case "вторник":
            case "среда":
            case "четверг":
            case "пятница":
                print($"День недели '{day}' — это рабочий день.");
                break;

            case "суббота":
            case "воскресенье":
                print($"День недели '{day}' — это выходной день!");
                break;

            default:
                print("Ошибка: некорректный день недели.");
                break;
        }
    }




// void Main()
//     {
//         // Задаем день недели прямо в коде
//         String day = "суббота";

//         switch (day.ToLower())
//         {
//             case "понедельник":
//             case "вторник":
//             case "среда":
//             case "четверг":
//             case "пятница":
//                 print($"День недели '{day}' — это рабочий день.");
//                 break;

//             case "суббота":
//             case "воскресенье":
//                 print($"День недели '{day}' — это выходной день!");
//                 break;

//             default:
//                 print("Ошибка: некорректный день недели.");
//                 break;
//         }
//     }
